# Задача 1: Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

n = int(input('Введите трёхзначное число:'))
if (n//1000 == 0): 
    print(f"{n//100 + n%10 + ((n-n%10)%100//10)}")
else:
    print(f"пи-пи-пи")
#print(f"{(n-n%10)%100//10}")

